[
    {
        "label": "industry1",
        "professions": [
            {
                "label": "Senior government managers and officials",
                "NOC": 12,
                "duties": [
                    "Establish objectives for the organization in accordance with government legislation and policy, formulate or approve and evaluate programs and procedures alone or in conjunction with senior government committees",
                    "Advise elected representatives on policy questions and refer major policy matters to these representatives for final decision",
                    "Recommend, review, evaluate and approve documents, briefs and reports submitted by middle managers and senior staff members",
                    "Co-ordinate department activities with other senior government managers and officials",
                    "Make presentations to legislative and other government committees regarding policies, programs or budgets",
                    "Allocate human and financial resources to implement organizational policies and programs",
                    "Establish financial and administrative controls."
                ],
                "skill": "A - Occupations usually require university education."
            },
            {
                "label": "Senior managers - health, education, social and community services and membership organizations",
                "NOC": 14,
                "duties": [
                    "Establish objectives for the organization or institution and formulate or approve policies and programs",
                    "Authorize and organize the establishment of major departments and associated senior staff positions",
                    "Allocate material, human and financial resources to implement organizational policies and programs; establish financial and administrative controls; formulate and approve promotional campaigns; and approve overall personnel planning",
                    "Select middle managers, directors or other executive staff",
                    "Co-ordinate the work of regions, divisions or departments",
                    "Represent the organization, or delegate representatives to act on behalf of the organization, in negotiations or other official functions."
                ],
                "skill": "A - Occupations usually require university education."
            },
            {
                "label": "Senior managers - construction, transportation, production and utilities",
                "NOC": 16,
                "duties": [
                    "Establish objectives for the company and formulate or approve policies and programs",
                    "Authorize and organize the establishment of major departments and associated senior staff positions",
                    "Allocate material, human and financial resources to implement company policies and programs; establish financial and administrative controls; formulate and approve promotional campaigns; and approve overall personnel planning",
                    "Select middle managers, directors or other executive staff",
                    "Co-ordinate the work of regions, divisions or departments",
                    "Represent the company, or delegate representatives to act on behalf of the company, in negotiations or other official functions."
                ],
                "skill": "A - Occupations usually require university education."
            }
        ]
    },
    {
        "label": "industry2",
        "professions": [
            {
                "label": "Human resources managers",
                "NOC": 112,
                "duties": [
                    "Plan, organize, direct, control and evaluate the operations of human resources or personnel departments",
                    "Plan human resource requirements in conjunction with other departmental managers",
                    "Co-ordinate internal and external training and recruitment activities",
                    "Develop and implement labour relations policies and procedures and negotiate collective agreements",
                    "Administer employee development, language training and health and safety programs",
                    "Advise and assist other departmental managers on interpretation and administration of personnel policies and programs",
                    "Oversee the classification and rating of occupations",
                    "Organize and conduct employee information meetings on employment policy, benefits and compensation and participate actively on various joint committees",
                    "Direct the organization's quality management program",
                    "Ensure compliance with legislation such as the ",
                    "Pay ",
                    "Equity ",
                    "Act."
                ],
                "skill": "A - Occupations usually require university education."
            },
            {
                "label": "Other administrative services managers",
                "NOC": 114,
                "duties": [
                    "Plan, organize, direct, control and evaluate the operations of a department providing a single administrative service or several administrative services",
                    "Direct and advise staff engaged in providing records management, security, finance, purchasing, human resources or other administrative services",
                    "Direct and control corporate governance and regulatory compliance procedures within the establishment",
                    "Plan, administer and control budgets for contracts, equipment and supplies",
                    "Prepare reports and briefs for management committees evaluating administrative services",
                    "Interview, hire and oversee training for staff."
                ],
                "skill": "A - Occupations usually require university education."
            }
        ]
    }
]